Repository: matthewbednarski/cdnjs-client
Catalog: cdnjs.*.po
Languages: it

source: Writing to $conf
it: Salvando sul file $conf

source: Fetching $res to $save_dir
it: Salvando $res in $save_dir

source: Fetching $RED$1$NORMAL to $RED$save_dir
it: Salvando $RED$1$NORMAL in $RED$save_dir

source: from $fetch_url
it: da $fetch_url

source: from $GRN$fetch_url
it: da $GRN$fetch_url

source: Fetching $res
it: Salvando $res

source: Fetching $RED$res
it: Salvando $RED$res

source: Success
it: Riuscito

source: Copying from temp directory $tmpdir
it: Spostando i file dalla cartella temp $tmpdir

source: Deleting temp directory $tmpdir
it: Cancellando la cartella $tmpdir

source: Cleaning dir '$d'.
it: Pulendo la cartella '$d'.

source: Options:
it: Opzioni:

source: --init, init initialize a config file
it: --init, init initializza un file di configurazione

source: --conf [CONFIG FILE] use a custom config file
it: --conf [CONFIG FILE] indicare una configurazione custom

source: --index, index [p/to/exclude] prints a list of link and script tags
it: --index, index [p/to/exclude] stampare una lista di tag link/script

source: --html, html [p/to/exclude] same as "--index"
it: --html, html [p/to/exclude] come "--index"

source: --nodev, nodev excludes non '.min.*' files; a flag for "--list"
it: --nodev, nodev esclude i file non '.min.*'; un flag per l'opzione "--list"

source: --dev, dev excludes '.min.*' files; a flag for "--list"
it: --dev, dev exclude i file '.min.*'; un flag per l'opzione "--list"

source: -f, --find, find [ARGS] perform query on api.cdnjs.com
it: -f, --find, find [ARGS] fai un query verso api.cdnjs.com

source: --search, search [ARGS] same as "--search [ARGS]"
it: --search, search [ARGS] come "--search [ARGS]"

source: -c, --clean, clean [ARGS] clean configured relative-location
it: -c, --clean, clean [ARGS] eliminare le cartelle indicate con i relative-location

source: -s, --sync, sync [ARGS] synchronize to configured relative-locations
it: -s, --sync, sync [ARGS] sincronizzare le relative-locations

source: --update, update [ARGS] same as "--sync [ARGS]"
it: --update, update [ARGS] come "--sync [ARGS]"

source: -a, + [LIB[+VERSION]] [GROUP] add library with optional version to optional group
it: -a, + [LIB[+VERSION]] [GROUP] aggiungere la libreria indicando, opzionalmente, la versione e la gruppo

source: -v, --verbose, verbose print debug/verbose output
it: -v, --verbose, verbose stampare l'output debug/verbose

source: --debug, debug same as "--verbose"
it: --debug, debug come "--verbose"

source: --nocolor, nocolor do not output in color, useful for logging stdout/stderr
it: --nocolor, nocolor non usare gli escape di colori, può servire se si deve salvare l'output di stdout/stderr

source: -h, -?, --help, help print usage
it: -h, -?, --help, help stampare usage

source: Adding $search version: $VERS
it: Aggiungendo $search versione: $VERS

source: Adding $search version: $RED$VERS
it: Aggiungendo $search versione: $RED$VERS

source: Successfully updated cdnjs config $CONF
it: Modificato la configurazione cdnjs $CONF

source: Successfully updated$GRN cdnjs$BLU config $GRN$CONF$BLU
it: Modificato la configurazione$GRN cdnjs$BLU $GRN$CONF$BLU

source: extracting list of link and script tags
it: estraendo la lista di tag link e script

source: Excluding min's from list!
it: Escludendo i file *.min.* dalla lista!

source: Excluding$RED min's$YELLOW from list!
it: Escludendo i file $RED*.min.*$YELLOW dalla lista!

source: Listing min's only!
it: Elencando solo i file *.min.*!

source: Listing$RED min's$YELLOW only!
it: Elencando solo i file $RED*.min.*$YELLOW!

source: Listing all available js's and css's!
it: Elencando tutti i file *.js e *.css!

source: Use --dev or --nodev flags for managing minified output
it: Utilizzare il flag --dev or --nodev per gestire i file *.min.*

source: Listing$RED all$YELLOW available$RED js's$YELLOW and$RED css's$YELLOW!
it: Elencando$RED tutti$YELLOW i file$RED *.js$YELLOW e$RED *.css$YELLOW!

source: Use $RED--dev$YELLOW or $RED--nodev$YELLOW flags for managing minified output
it: Utilizzare il flag$RED --dev$YELLOW or$RED --nodev$YELLOW per gestire i file *.min.*

source: Creating directory $dir
it: Creando la cartella $dir

source: Could not delete $d
it: La cartella $d non è stata eliminata

source: Successfully deleted $d
it: La cartella $d è stata eliminata

source: using default config: $CONF
it: usando la configurazione: $CONF

source: Listing script and link tags from $CONF
it: Elencando i tag script e link trovati in $CONF

source: Listing script and link tags from $RED$CONF
it: Elencando i tag script e link trovati in $RED$CONF

source: Initializing config file $CONF
it: Inizializzando la configurazione di cdnjs nel file $CONF

source: Initializing config file $RED$CONF
it: Inizializzando la configurazione di cdnjs nel file $RED$CONF

source: CLEANING file $CONF
it: PULENDO i percorsi gestiti da $CONF

source: CLEANING file $RED$CONF
it: PULENDO i percorsi gestiti da $RED$CONF

source: Successfully cleaned 'relative-location's
it: I percorsi indicati con i 'relative-location' sono stati eliminati

source: SYNCING file $CONF
it: SYNCRONIZZANDO la configurazione $CONF

source: SYNCING file $RED$CONF
it: SYNCRONIZZANDO la configurazione $RED$CONF

source: SEARCHING for $ARGS
it: CERCANDO per $ARGS

source: SEARCHING for $RED$ARGS
it: CERCANDO per $RED$ARGS

source: Could not download file $1
it: Il file $1 non è stato scaricato

source: Exiting with status code $ret
it: Uscendo con status $ret

source: Dir '$d' does not exist.
it: La cartella '$d' non esiste.

source: A cdnjs-client configuration file is required!
it: Una configurazione cdnjs-client è obbligatorio!

source: Cleaning was not successful
it: Pulizia non riuscita

source: no assets found for the library: $search, version: $version
it: nessun asset trovato per: $search, versione: $version

source: no assets found for the library: $GRN$search$RED, version: $GRN$version
it: nessun asset trovato per: $GRN$search$RED, versione: $GRN$version

source: no assets found for the library: $GRN$search
it: nessun asset trovato per: $GRN$search

source: Custom location
it: Percorso custom
